In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("data.csv")

In [3]:
df=pd.DataFrame(data)

In [9]:
df.head(n=3)

    Name  Rollno  Admno College
0  Annie      12   2134   MBCET
1   John      25   3276     SCT
2   Joel      28   1005     CET

In [7]:
df.tail(n=7)

        Name  Rollno  Admno College
2       Joel      28   1005     CET
3      Meera      45   3543     LBS
4      Sneha      60   2568     LBS
5  Aishwarya      10   3765   MBCET
6       Abel       2   2136     CET
7      Veena      32   4532     SCT
8       Tina      47   2118   MBCET

In [8]:
df.describe()

          Rollno        Admno
count   9.000000     9.000000
mean   29.000000  2786.333333
std    19.189841  1080.128349
min     2.000000  1005.000000
25%    12.000000  2134.000000
50%    28.000000  2568.000000
75%    45.000000  3543.000000
max    60.000000  4532.000000

In [10]:
sdf=df[["Rollno","College"]]

In [11]:
sdf.head()

   Rollno College
0      12   MBCET
1      25     SCT
2      28     CET
3      45     LBS
4      60     LBS